Tekla.Structures.DrawingInternal.RevisionMark
Represents a revision mark. TODO: This class is a placeholder to simply have some instance to represent a
revision mark on a selection event.

Tekla.Structures.DrawingInternal.RevisionMark.#ctor
Initializes a new instance of the Tekla.Structures.DrawingInternal.RevisionMark class.

Tekla.Structures.DrawingInternal.RevisionMark.Delete
Does nothing.
Returns: Always true

Tekla.Structures.DrawingInternal.RevisionMark.Insert
Does nothing.
Returns: Always true

Tekla.Structures.DrawingInternal.RevisionMark.IsEqual(System.Object)
Does nothing.
objectToCompare: Object to compare to.
Returns: true if the object is a Tekla.Structures.DrawingInternal.RevisionMark

Tekla.Structures.DrawingInternal.RevisionMark.Modify
Does nothing.
Returns: Always true

Tekla.Structures.DrawingInternal.RevisionMark.Select
Does nothing.
Returns: Always true